{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title","getFn":null},{"path":["body"],"id":"body","weight":1,"src":"body","getFn":null}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"Root","n":1},"1":{"v":"# Welcome to Dendron\n\nThis is the root of your dendron vault. If you decide to publish your entire vault, this will be your landing page. You are free to customize any part of this page except the frontmatter on top.\n\n## Lookup\n\nThis section contains useful links to related resources.\n\n- [Getting Started Guide](https://link.dendron.so/6b25)\n- [Discord](https://link.dendron.so/6b23)\n- [Home Page](https://wiki.dendron.so/)\n- [Github](https://link.dendron.so/6b24)\n- [Developer Docs](https://docs.dendron.so/)","n":0.132}}},{"i":2,"$":{"0":{"v":"Dimensional Mercenary","n":0.707}}},{"i":3,"$":{"0":{"v":"The Lost Mine of Phandelver","n":0.447},"1":{"v":"<span style=\"color:red\">red text</span>\n\n## Characters\n- Dungeon Master: Kyle Tuico\n- Akta: Kyle Tibayan\n- Emerit: Francis\n- Gondorf: Hans\n- Hildebrand: Michael\n- Pieck: Nil\n- Shadow: Ethan\n- Tim: Lee\n\n## After the dragon slaying...\n- Since we slayed the dragon, we were told where Wave Echo cave is\n    - *Everyone* now knows where Wave Echo cave is, including Iarno\n    - Technically, we don't need to save Gundren anymore, we can just go straight to Wave Echo cave, since our summoner is Korvac\n\n## Connyberry\n- Arrive at 20:00 -- it's foggy\n- We see the entrance of her home: a hole in a tree with a lantern outside\n    - Emerit aggressively rolls a Rock of Yondallah into the opening\n    - Akta whispers \"Agatha\" towards the opening\n        - Fog grows colder around us, but no one comes out\n    - Emerit throws paper airplane made of Pamphlet of Researchtology through the opening\n        - The paper airplane flies in but disappears\n- The witch comes out with the paper airplane in her hand then burns it\n    - She says: \"Who are you?!\"\n    - Tim greets her politely\n    - She ignores Tim and instead floats towards Akta: \"Are you a descendant of a Dendrar?\"\n    - We remember Mirna's last name is Dendrar... Akta says: \"We found it in a house.\"\n    - She takes the crown off Akta's head\n    - Akta asks for information before letting her keep the crown\n    - She says: \"I made a pact so that in exchange for the crown, I'll help the Dendrar family as much as I can\"\n    - We ask her for 6000 GP\n    - She says: \"Instead, how about I give you information on how you can get that much gold?\"\n    - Tim says: \"Are you talking about Wave Echo cave?\"\n    - She realizes that we're foreigners and tells us we can't use the money in the cave because we'd need to mine it\n- We start asking her about the Black Spider...\n- To gain info without giving up the crown, we would need to give her Mirna\n- (Curious about how strong she is) She says that she's weaker than Venomfang, she thinks she *may be able to* kill Iarno\n- Gondorf gives her a truth serum to drink... She says \"Are you sure you wanna waste this on me?\", so he puts it back in his bag\n- We agree to get Mirna and give it to her so she can break the pact without us having to give her the crown\n    - But we have to leave her with Gondorf and the crown\n    - Gondorf learns a new spell in the meantime\n- We ask her why she wouldn't want to kill Iarno?\n    - **She says: \"What's the point in killing a puppet?\"**\n- We bring her Mirna\n    - She demands we ask her our question now... We ask: \"Tell us everything about the Black Spider?\"\n        - Neznar\n        - He's a drow\n        - He leads a band of elves who are seeking to take over Wave Echo cave\n    - The witch shrivels up and turns into dust\n    - The fog lifts from the forest\n    - *Essentially, Agatha was a banshee (already dead) and her pact with the Dendrars were keeping her in this world, so breaking the pact with Mirna allowed her to die*\n    - *We get to keep the 5000 GP crown and Mirna, yay :)*\n\n## Return to Phandalen\n- Korvac wants to save Gundren, but Sildar doesn't care about him anymore\n- We ask: \"Korvac, how would you feel if we go straight to Wave Echo cave?\"\n    - Korvac: \"I owe him my life!\"\n    - Sildar: \"You can live your own life now!\"\n- Tim convinces them to save Gundren by saying Gundren will give them the riches from Wave Echo cave\n- We go to see Iarno\n    - Thanks us for helping with the dragon, offers us stuff in exchange for our services\n    - Offers us gold (1500 each), or new spells, or potions\n        - *Hildebrand buys Summon Elemental from me for 100 GP*\n- We head to Cragmaw Castle with Sildar\n\n## Cragmaw Castle\n- We see muddy footsteps leading up the stairs and through entryway, with dried blood -- looks like someone was dragged\n- A drow spots us and tells us to leave, tells us Gundren isn't here\n    - We show the drow the Glass Staff, but he doesn't recognize it\n- We decide to just go around the building on the south side\n- <span style=\"color:red\">We encounter some goblins and fight them</span>","n":0.037}}}]}
