{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title","getFn":null},{"path":["body"],"id":"body","weight":1,"src":"body","getFn":null}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"Root","n":1},"1":{"v":"# Welcome to Dendron\n\nThis is the root of your dendron vault. If you decide to publish your entire vault, this will be your landing page. You are free to customize any part of this page except the frontmatter on top.\n\n## Lookup\n\nThis section contains useful links to related resources.\n\n- [Getting Started Guide](https://link.dendron.so/6b25)\n- [Discord](https://link.dendron.so/6b23)\n- [Home Page](https://wiki.dendron.so/)\n- [Github](https://link.dendron.so/6b24)\n- [Developer Docs](https://docs.dendron.so/)\n","n":0.132}}},{"i":2,"$":{"0":{"v":"Dimensional Mercenary","n":0.707}}},{"i":3,"$":{"0":{"v":"The Lost Mine of Phandelver","n":0.447},"1":{"v":"<span style=\"color:red\">Red text indicates combat</span>\n\n## Characters\n- Dungeon Master: Kyle Tuico\n- Akta: Kyle Tibayan\n- Emerit: Francis\n- Gondorf: Hans\n- Hildebrand: Michael\n- Pieck: Nil\n- Shadow: Ethan\n- Tim: Lee\n\n## Thundertree\n- <span style=\"color:red\">Immediately, Ends attack us and get fucked by Emerit</span>\n- We meet Reidoth, druid from the Emerald Enclave\n    - He watches over Phandalen and warns people who enter this area of the zombies\n    - He studied the zombification phenomenon\n    - Can fight but prefers not to\n- **Reidoth gives us a map of Cragmaw Castle**\n    - In exchange, he asks us to convince the cultists here to leave the nearby tower\n        - They are dragon-worshippers that keep giving gifts to the dragon that lives in the tower in the east\n        - They wear black masks and cloaks\n        - If we drive the dragon away or kill it, we get to keep the loot\n- Phandelver's Pact\n    - It's the agreement to share Wave Echo cave, which has unlimited minerals to mine between the humans, elves, etc.\n    - He knows where it is (and it's the cave Gundren is looking for)\n- We decide to look around the area...\n    - **We find Dendrar's Silver Crown, Mirna's family's heirloom, worth 5000 GP**\n        - **It can be given to a witch nearby for a favor**\n- We encounter the cultists\n    - We convince them to instead praise Shenron Barney Targeryn V ![Shenron Barney Targeryn V](./assets/images/shenron.png)\n- We tell Reidoth that the dragon might terrorize neighboring villages now that the cultists are leaving\n    - He becomes worries and decides to talk to Iarno about it\n- **He gives us a map of Wave Echo cave**\n- We ask if there's a witch nearby...\n    - Agatha is a with that lives 1 hour south, near Connyberry  Village\n    - Agatha is introverted\n- We decide to talk to the dragon, Venomfang\n    - Sildar gets frustrated that we've abandoned the main mission (lol) and leaves before we confront Venomfang\n    - We convince Venomfang to try to go to Neverwinter for more riches, but he still wants to eat us...\n    - We lure him outside, telling him he can eat Akta's arm instead of eating us\n    - <span style=\"color:red\">Akta feigns cutting off his arm twice, attempting to attack Venomfang, but misses both times</span>\n        - Venomfang attacks us\n        - Mid-combat, Iarno, Reidoth, and Sildar arrive to help\n        - We slay Venomfang!\n- Since we slayed Venomfang, we were told where Wave Echo cave is\n    - *Everyone* now knows where Wave Echo cave is, including Iarno\n    - Technically, we don't need to save Gundren anymore, we can just go straight to Wave Echo cave, since our summoner is Korvac\n    - We decide to go to Connyberry first\n\n## Connyberry\n- Arrive at 20:00 -- it's foggy\n- We see the entrance of her home: a hole in a tree with a lantern outside\n    - Emerit aggressively rolls a Rock of Yondallah into the opening\n    - Akta whispers \"Agatha\" towards the opening, and the fog grows colder around us, but no one comes out\n    - Emerit throws paper airplane made of Pamphlet of Researchtology through the opening, which flies in but disappears\n- The witch comes out with the paper airplane in her hand then burns it\n    - She sees the Dendrar's Silver Crown on Akta's head and asks him if he's a descendant of a Dendrar\n    - She eventually takes the crown off Akta's head\n    - Akta asks for information before letting her keep the crown\n    - She says: \"I made a pact so that in exchange for the crown, I'll help the Dendrar family as much as I can\"\n- We ask her for 6000 GP\n    - She instead offers to tell us about Wave Echo cave, but we already know about it\n        - She then realizes that we're foreigners and tells us we can't use the money in the cave because we'd need to mine it\n- We start asking her about the Black Spider, but she refuses to give info without the crown or Mirna\n- We contemplate killing her, so we ask how strong she is\n    - She says that she's weaker than Venomfang, she thinks she *may be able to* kill Iarno\n    - **We ask her why she wouldn't want to kill Iarno, and she says: \"What's the point in killing a puppet?\"**\n- We eventually agree to get Mirna and give it to her so she can break the pact without us having to give her the crown\n    - But we have to leave her with Gondorf and the crown\n    - Gondorf learns a new spell in the meantime\n- We bring her Mirna\n    - She demands we ask her our question now... We ask: \"Tell us everything about the Black Spider?\"\n        - His name is Neznar\n        - He's a drow\n        - He leads a band of elves who are seeking to take over Wave Echo cave\n- The witch shrivels up and turns into dust\n    - The fog lifts from the forest\n    - *Essentially, Agatha was a banshee (already dead) and her pact with the Dendrars were keeping her in this world, so breaking the pact with Mirna allowed her to die*\n    - *We get to keep the 5000 GP crown and Mirna, yay :)*\n\n## Return to Phandalen\n- Korvac wants to save Gundren, but Sildar doesn't care about him anymore\n- We ask: \"Korvac, how would you feel if we go straight to Wave Echo cave?\"\n- Tim convinces them to save Gundren by saying Gundren will give them the riches from Wave Echo cave\n- Before heading to Cragmaw Castle, we go to see Iarno\n    - Thanks us for helping with the dragon, offers us stuff in exchange for our services\n    - Offers us gold (1500 each), or new spells, or potions\n        - *Hildebrand buys Summon Elemental from me for 100 GP*\n- We head to Cragmaw Castle with Sildar\n\n## Cragmaw Castle\n- We see muddy footsteps leading up the stairs and through entryway, with dried blood -- looks like someone was dragged\n- A drow spots us and tells us to leave, tells us Gundren isn't here\n    - We show the drow the Glass Staff, but he doesn't recognize it\n- We decide to just go around the building on the south side\n- <span style=\"color:red\">We encounter some goblins and fight them</span>","n":0.031}}},{"i":4,"$":{"0":{"v":"Tutorial","n":1},"1":{"v":"\nWelcome to Dendron! Dendron is a developer-focused knowledge base that helps you manage information using **flexible hierarchies**!\n\nYou are currently in the tutorial vault (a vault is the folder where your notes are stored). Feel free to edit this note and create new files as you go through the quickstart!\n\n## Create a Note\n\n1. Use `Ctrl+L` / `Cmd+L` to bring up the lookup prompt\n1. Type `dendron` and select `Create New`\n\n- > NOTE: After you press enter, Dendron will create and open the `dendron` note. Use `<CTRL>-<TAB>` to come back to this note\n\nYou just created your first note!\n\n- > NOTE: Notes in Dendron are just plain text markdown with some [frontmatter](https://wiki.dendron.so/notes/ffec2853-c0e0-4165-a368-339db12c8e4b) on the top. You can edit them in Dendron or using ~~vim~~ your favourite text editor.\n\n## Find a Note\n\n1. Use `Ctrl+L` / `Cmd+L` to bring up the lookup prompt again\n1. Type `dendron` and press `<ENTER>`\n\n- > TIP: you don't have to type out the entire query, press `<TAB>` to autocomplete\n\nYou just `looked up` a note!\n\n- > NOTE: in Dendron, you can find or create notes using the lookup prompt\n\n## Organize your Notes\n\n1. Bring up the lookup prompt again\n1. Type `tutorial.one`\n\nYou just created your first hierarchy!\n\n- > NOTE: hierarchies in Dendron are just `.` delimited files. This makes each note both a file and a folder and makes it easy to keep your notes organized\n\n- > TIP: You can use the [Dendron Tree View](https://wiki.dendron.so/notes/hur7r6gr3kqa56s2vme986j) to view your hierarchy. If it's not currently in focus, you can use `CTRL+SHIFT+P`/`CMD+SHIFT+P` to open the command prompt and type in `Dendron: focus on tree view` to make it appear\n\n## Create a link\n\n1. In the current note, type `[[` - this should trigger the autocomplete. You can type `one` to narrow it down to the note you just created and hit enter\n<!-- Enter '[[' below-->\n\n<!-- End space-->\n\nYou just created your first link!\n\n- > NOTE: the links with the `[[` are called wikilinks (because they were first popularized by Wikipedia)\n- > TIP: If you hover your mouse over the link, you can get a preview of the contents inside the note!\n\n## Navigate a link\n\n1. Move your text cursor over the link you just created. Hold down `<CTRL>+<ENTER>`/`<CMD>+<ENTER>`\n\n- > TIP: You can also use `CTRL+CLICK` or `CMD+CLICK` to navigate links via mouse\n\nYou just navigated the link!\n\n## Refactor a Note\n\n1. Open [[tutorial.one]], bring up the command prompt (`CTRL+SHIFT+P`/`CMD+SHIFT+P`) and type `Dendron: Rename Note`\n1. Replace `tutorial` with `my-note` and then press `<ENTER>`\n1. You just refactored the note!\n\n- > NOTE: when you rename a note, Dendron updates all links and references of the original note being renamed. Try switching back to [[tutorial]] to see the updated link!\n- > TIP: in addition to renaming one note at a time, dendron has [an entire collection](https://wiki.dendron.so/notes/srajljj10V2dl19nCSFiC) of refactoring commands that let you change headers, move around sections, and refactor entire hierarchies!\n\n## Conclusion\n\nCongrats, you finished the Dendron tutorial!\n\nWas there anything **unclear or buggy** about this tutorial? Please [**report it**](https://github.com/dendronhq/dendron/discussions/3266) so we can **make it better**!\n\n## Next Steps\n\nDepending on your needs, here are some common next steps:\n\n- I want to **start writing**: [Create a daily journal note](command:dendron.createDailyJournalNote) ([docs](https://wiki.dendron.so/notes/ogIUqY5VDCJP28G3cAJhd))\n\n- I want to **use templates**: Use the [Appy Template](https://wiki.dendron.so/notes/ftohqknticu6bw4cfmzskq6) command to apply [templates](https://wiki.dendron.so/notes/861cbdf8-102e-4633-9933-1f3d74df53d2) to existing notes\n\n- I want to do a **longer tutorial**: Check out our [5min tutorial to explore more of Dendron's functionality](https://wiki.dendron.so/notes/678c77d9-ef2c-4537-97b5-64556d6337f1/)\n\n- I want to **implement a particular workflow** (bullet journal, zettelkasten, etc): Check out community [workflow guides](https://wiki.dendron.so/notes/9313b845-d9bf-42c9-aad1-0da34794ce26)\n\n- I want to use Dendron for **tasks and todos**: See the [Getting Things Done (GTD), Bullet Journaling, and Other Task Management Workflows](https://wiki.dendron.so/notes/ordz7r99w1v099v14hrwgnp) for how the founder of Dendron uses it to manage his work.\n\n- I want to explore **advanced features**: See [next steps](https://wiki.dendron.so/notes/TflY5kn29HOLpp1pWT9tP) for longer walkthroughs and advanced functionality!\n\n- I want to start clean with a **new vault at a custom location**: Run [Dendron: Initialize Workspace](command:dendron.initWS) from the command prompt (or click this link) to start from a clean slate\n\n- I want to use Dendron as a **knowledge base for my team**: Read the [Dendron team setup](https://wiki.dendron.so/notes/98f6d928-3f61-49fb-9c9e-70c27d25f838) to get started\n\n> Coming from Obsidian? Click [here](command:dendron.importObsidianPod) to import your Obsidian notes (or any markdown notes) into Dendron to see how they look.\n\n## Community\n\nDendron is more that just a tool - we are also a community of individuals that are passionate about knowledge management. If you need help or want to connect with the community, join us in the [Discords](https://link.dendron.so/discord).\n\nYou can also:\n\n- Star us on [GitHub](https://github.com/dendronhq/dendron)\n- Follow us on [Twitter](https://twitter.com/dendronhq)\n- Subscribe to the [Dendron Newsletter](https://link.dendron.so/newsletter)\n","n":0.037}}}]}
